export default {
    tab: {
        admin: {
            settings: "Настройки",
            order: "Заказ",
            scan: "Сканировать",
            analytics: "Аналитика",
            whoIsIn: "Кто внутри?",
            other: "Другое",
        },
        employee: {
            enter: "Вход",
            leave: "Выход",
            info: "Информация",
            whoIsIn: "Кто внутри?",
            other: "Другое",
        },
    },
    stack: {
        adminOther: {
            other: "Другое",
            settings: "Настройки",
            registration: "Регистрация",
            enter: "Вход",
            leave: "Выход",
            info: "Информация",
        },
        qrScan: {
            qrScan: "Сканирование QR",
        },
    },
    screen: {
        qrScan: {
            scanning: "Сканирование",
            ready: "Я готов к сканированию",
            checkingCamera: "Проверка доступности камеры...",
            cameraUnavailable: "Камера недоступна. Попробуйте ещё раз",
            noAccess: "Нет доступа к камере. Пожалуйста, разрешите доступ",
            noCamera: "Нет доступа к камере на этом устройстве",
            allowCamera: "Разрешить камеру",
            start: "Начать сканирование",
            stop: "Остановить сканирование",
        },
        registration: {
            email: {
                placeholder: "Электронная почта",
                error: "Введен некорректный адрес электронной почты",
                required: "Электронная почта обязательна",
                min4: "Электронная почта должна содержать не менее 4-х символов",
            },
            name: {
                placeholder: "Имя",
                required: "Обязательное поле",
            },
            password: {
                placeholder: "Пароль",
                digit1: "Пароль должен содержать хотя бы одну цифру",
                required: "Обязательное поле",
                min6: "Пароль должен содержать не менее 6-ти символов",
            },
            confirmPassword: {
                placeholder: "Подтвердите пароль",
                required: "Обязательное поле",
                min6: "Пароль должен содержать не менее 6-ти символов",
                match: "Пароли должны совпадать",
            },
            roleId: {
                placeholder: "Роль",
                required: "Обязательное поле",
            },
            submit: "Зарегистрировать",
        },
        login: {
            email: {
                placeholder: "Электронная почта",
                error: "Введен некорректный адрес электронной почты",
                required: "Электронная почта обязательна",
                min4: "Электронная почта должна содержать не менее 4-х символов",
            },
            password: {
                placeholder: "Пароль",
                required: "Обязательное поле",
                min6: "Пароль должен содержать не менее 6-ти символов",
            },
            submit: "Вход",
        },
        settings: {
            deleteData: "Удалить сохраненные данные",
            theme: "Темная тема",
            language: "Язык",
            alert:{
                confirmationTitle: "?№?!*%?!",
                confirmationText: "Вы действительно хотите удалить сохраненные данные?",
                cancel: "Отменить",
                confirm: "Подтвердить",
            }
        },
    }
};
